import { GEOMETRY, ALGEBRA } from "./constants";

export default {
  [ALGEBRA]: [
    {
      id: "algebra-0",
      title: "Естествени числа. Цели числа. Рационални числа. Реални числа.",
    },
    {
      id: "algebra-1",
      title:
        "Формули за съкратено умножение. Преобразуване на рационални изрази. Коренуване. Ирационални изрази.",
    },
    {
      id: "algebra-2",
      title:
        "Уравнения. Еквивалентни уравнения. Неравенства. Еквивалентни неравенства. Системи уравнения. Системи неравенства. Смесени системи уравнения и неравенства;",
    },
    {
      id: "algebra-3",
      title:
        "Уравнения от първа степен с едно неизвестно. Квадратни уравнения. Формули на Виет. Разлагане на квадратен тричлен на линейни множители. Разпределение на корените на квадратния тричлен. Уравнения от по-висока степен, приводими към квадратни. Ирационални уравнения. Модулни уравнения.",
    },
    {
      id: "algebra-4",
      title:
        "Неравенства от първа и втора степен. Неравенства от по-висока степен и рационални неравенства - метод на интервалите. Ирационални и модулни неравенства;",
    },
    {
      id: "algebra-5",
      title: "Степен с реален показател. Логаритъм.",
    },
    {
      id: "algebra-6",
      title:
        "Показателна функция - графика и свойства. Логаритмична функция - графика и свойства. Логаритмични и показателни уравнения. Логаритмични и показателни неравенства;",
    },
    {
      id: "algebra-7",
      title:
        "Тригонометрични функции: синус, косинус, тангенс, котангенс - графики и свойства. Тригонометрични тъждества. Преобразуване на тригонометрични изрази. Тригонометрични уравнения. Тригонометрични неравенства;",
    },
    {
      id: "algebra-8",
      title:
        "Числови редици. Аритметична и геометрична прогресия. Формули за общ член и сума на първите n члена. Процент, проста и сложна лихва. Принцип на математическата индукция. Сходящи редици. Сума на членовете на безкрайна геометрична прогресия с частно от интервала (-1,1);",
    },
    {
      id: "algebra-9",
      title:
        "Числови функции. Четни, нечетни, периодични функции. Граници на функции. Непрекъснатост. Производни. Теореми за производните. Геометричен смисъл на производната, уравнение на допирателната (към графиката на функцията в точката), Монотонност на функции. Локални екстремуми на функции. Най-голяма и най-малка стойност на функции. Изследване на функции;",
    },
    {
      id: "algebra-10",
      title:
        "Решаване на уравнения, неравенства и системи уравнения от смесен тип. Приложения на уравненията, неравенствата, системите и изследването на функции за решаване на практически задачи;",
    },
    {
      id: "algebra-11",
      title:
        "Комбинаторика - пермутации, вариации и комбинации без повторения.",
    },
    {
      id: "algebra-12",
      title:
        "Вероятности и статистика – случайни събития, класическа вероятност, статистически ред, статистически средни, статистически диаграми.",
    },
  ],
  [GEOMETRY]: [
    {
      id: "geometry-0",
      title:
        "Основни понятия в геометрията. Успоредност, перпендикулярност, ъгли, образувани от пресичане на две прави с трета. Условия за успоредност.",
    },
    {
      id: "geometry-1",
      title:
        "Еднаквост. Признаци за еднаквост на триъгълници. Успоредници - видове, свойства. Трапец. Средна отсечка в триъгълник и трапец. Лице на многоъгълник.",
    },
    {
      id: "geometry-2",
      title:
        "Окръжност. Допирателна към окръжност. Централен, вписан и периферен ъгъл. Допиращи се окръжности. Описана около триъгълник окръжност. Вписана и външно вписани окръжности за триъгълник. Медицентър и ортоцентър на триъгълник. Четириъгълник, вписан в окръжност и четириъгълник, описан около окръжност - свойства. Правилни многоъгълници. Транслация, ротация, симетрия.",
    },
    {
      id: "geometry-3",
      title:
        "Теорема на Талес. Свойства на ъглополовящите в триъгълник. Подобност. Признаци за подобност на триъгълници. Връзка между лицата на подобни триъгълници. Хомотетия",
    },
    {
      id: "geometry-4",
      title:
        "Теорема на Питагор. Метрични зависимости в правоъгълен триъгълник. Косинусова и синусова теорема. Метрични зависимости в произволен триъгълник. Решаване на триъгълник. Основни формули за лице на триъгълник и четириъгълник. Формула на Херон.",
    },
    {
      id: "geometry-5",
      title:
        "Взаимно положение на две прави, на права и равнина и на две равнини в пространството. Ъгъл, определен от две кръстосани прави. Ъгъл, определен от права и равнина. Перпендикулярност на права и равнина. Теорема за трите перпендикуляра. Ъгъл, определен от две равнини. Линеен ъгъл на двустенен ъгъл. Перпендикулярност на две равнини;",
    },
    {
      id: "geometry-6",
      title:
        "Многостени. Призма, паралелепипед, пирамида, пресечна пирамида. Ротационни тела. Цилиндър, конус, пресечен конус, сфера;",
    },
    {
      id: "geometry-7",
      title:
        "Комбинации от тела. Сечения на многостени и ротационни тела с равнина. Формули за лицата на повърхнините и обемите на многостени и ротационни тела;",
    },
    {
      id: "geometry-8",
      title:
        "Екстремални геометрични задачи и екстремални задачи с линейна и квадратна функция",
    },
  ],
};
